In [28]:
# Import Dependencies
import os
import pandas as pd
import requests
import json
import csv
import datetime as dt
from dateutil.relativedelta import relativedelta 
import psycopg2
import psycopg2.extras as extras 
import numpy as np
import sqlalchemy
from sqlalchemy import create_engine

In [14]:
# Read csv files
airbnb_csv = pd.read_csv("./Data/AB_US_2020.csv", low_memory=False)
airports_csv = pd.read_csv("./Data/airports.csv", low_memory=False)
airbnb = airbnb_csv
airports = airports_csv
airbnb.head()
airports.head()

,IATA,AIRPORT,CITY,STATE,COUNTRY,LATITUDE,LONGITUDE
0,ABQ,Albuquerque International,Albuquerque,NM,USA,35.040222,-106.609194
1,ANC,Ted Stevens Anchorage International,Anchorage,AK,USA,61.174320,-149.996186
2,ATL,William B Hartsfield-Atlanta Intl,Atlanta,GA,USA,33.640444,-84.426944
3,AUS,Austin-Bergstrom International,Austin,TX,USA,30.194533,-97.669872
4,BDL,Bradley International,Windsor Locks,CT,USA,41.938874,-72.683228

In [67]:
# Create connection to PostgreSQL
from config import username, password, port, dbase
engine = create_engine(f'postgresql://{username}:{password}@localhost:{port}/{dbase} ')

In [ ]:
# SQL insert functiont to insert airbnb_csv into a PostgreSQL table.

def execute_values(conn, df, table):

	tuples = [tuple(x) for x in df.to_numpy()]

	cols = ','.join(list(df.columns))
	# SQL query to execute
	query = "INSERT INTO %s(%s) VALUES %%s" % (table, cols)
	cursor = conn.cursor()
	try:
		extras.execute_values(cursor, query, tuples)
		conn.commit()
	except (Exception, psycopg2.DatabaseError) as error:
		print("Error: %s" % error)
		conn.rollback()
		cursor.close()
		return 1
	print("the dataframe is inserted")
	cursor.close()


conn = psycopg2.connect(
	database="AirBnB", user='postgres', password='bootcamp', host='127.0.0.1', port='5432'
)

df = pd.read_csv('./Data/AB_US_2020.csv', low_memory=False)

execute_values(conn, df, 'stg_airbnbs')

In [22]:
## SQL insert functiont to insert airports into a PostgreSQL table.

def execute_values(conn, df, table):

	tuples = [tuple(x) for x in df.to_numpy()]

	cols = ','.join(list(df.columns))
	# SQL query to execute
	query = "INSERT INTO %s(%s) VALUES %%s" % (table, cols)
	cursor = conn.cursor()
	try:
		extras.execute_values(cursor, query, tuples)
		conn.commit()
	except (Exception, psycopg2.DatabaseError) as error:
		print("Error: %s" % error)
		conn.rollback()
		cursor.close()
		return 1
	print("the dataframe is inserted")
	cursor.close()


conn = psycopg2.connect(
	database="AirBnB", user='postgres', password='bootcamp', host='127.0.0.1', port='5432'
)

df = pd.read_csv('./Data/airports.csv', usecols = ['IATA', 'AIRPORT', 'CITY','STATE','LATITUDE','LONGITUDE'], low_memory=False)

execute_values(conn, df, 'stg_airports')

the dataframe is inserted

In [49]:
# Hosts DF
hosts_df = airbnb[['host_id', 'host_name', 'calculated_host_listings_count']]
# Get unique values
hosts_df.drop_duplicates()

          host_id  host_name  calculated_host_listings_count
0          165529    Evelyne                               1
1          427027    Celeste                              11
2          320564       Lisa                               2
3          746673    BonPaul                               5
4          769252  Elizabeth                               1
...           ...        ...                             ...
226016  225239104      Chris                               1
226018  309580714        Duo                               4
226019   35906256     Melina                               1
226026  231133074     Thomas                               1
226027   33758935     Bassem                               1

[131336 rows x 3 columns]

In [40]:
# Room Type DF
room_type_df = airbnb[['room_type']]
room_type_df.drop_duplicates().reset_index()

   index        room_type
0      0     Private room
1      1  Entire home/apt
2    100       Hotel room
3    185      Shared room

In [47]:
# Room type dimension load
def execute_values(conn, df, table):

	tuples = [tuple(x) for x in df.to_numpy()]

	cols = ','.join(list(df.columns))
	# SQL query to execute
	query = "INSERT INTO %s(%s) VALUES %%s" % (table, cols)
	cursor = conn.cursor()
	try:
		extras.execute_values(cursor, query, tuples)
		conn.commit()
	except (Exception, psycopg2.DatabaseError) as error:
		print("Error: %s" % error)
		conn.rollback()
		cursor.close()
		return 1
	print("the dataframe is inserted")
	cursor.close()


conn = psycopg2.connect(
	database="AirBnB", user='postgres', password='bootcamp', host='127.0.0.1', port='5432'
)

df = room_type_df.drop_duplicates()
#read_csv('./Data/airports.csv', usecols = ['IATA', 'AIRPORT', 'CITY','STATE','LATITUDE','LONGITUDE'], low_memory=False)

execute_values(conn, df, 'room_types')

the dataframe is inserted

In [50]:
# Hosts dimension load
def execute_values(conn, df, table):

	tuples = [tuple(x) for x in df.to_numpy()]

	cols = ','.join(list(df.columns))
	# SQL query to execute
	query = "INSERT INTO %s(%s) VALUES %%s" % (table, cols)
	cursor = conn.cursor()
	try:
		extras.execute_values(cursor, query, tuples)
		conn.commit()
	except (Exception, psycopg2.DatabaseError) as error:
		print("Error: %s" % error)
		conn.rollback()
		cursor.close()
		return 1
	print("the dataframe is inserted")
	cursor.close()


conn = psycopg2.connect(
	database="AirBnB", user='postgres', password='bootcamp', host='127.0.0.1', port='5432'
)

df = hosts_df.drop_duplicates()

execute_values(conn, df, 'hosts')

the dataframe is inserted

In [6]:
# Create airbnb fact table df
import pandas as pd
from sqlalchemy import create_engine
from config import username, password, port, dbase
engine = create_engine(f'postgresql://{username}:{password}@localhost:{port}/{dbase}')
connection = engine.connect()

df1 = pd.read_sql('select * from stg_airbnbs', connection)
# df2 = pd.read_sql('select id, host_id, host_name from hosts', connection)
# df3 = pd.read_sql('select room_id, room_type from room_types', connection)

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,city
0,38585,Charming Victorian home - twin beds + breakfast,165529,Evelyne,NaN,28804,35.65146,-82.62792,Private room,60.0,1,138,16/02/20,1.14,1,0,Asheville
1,80905,French Chic Loft,427027,Celeste,NaN,28801,35.59779,-82.55540,Entire home/apt,470.0,1,114,07/09/20,1.03,11,288,Asheville
2,108061,Walk to stores/parks/downtown. Fenced yard/Pet...,320564,Lisa,NaN,28801,35.60670,-82.55563,Entire home/apt,75.0,30,89,30/11/19,0.81,2,298,Asheville
3,155305,Cottage! BonPaul + Sharky's Hostel,746673,BonPaul,NaN,28806,35.57864,-82.59578,Entire home/apt,90.0,1,267,22/09/20,2.39,5,0,Asheville
4,160594,Historic Grove Park,769252,Elizabeth,NaN,28801,35.61442,-82.54127,Private room,125.0,30,58,19/10/15,0.52,1,0,Asheville